Repository: NateWr/googleFontsOJSPlugin
Catalog: locale/*/locale.po
Languages: de_de

# plugins.generic.googleFonts.description
source: Use any Google Font in your theme without compromising visitor privacy.
de_de: Verwenden Sie jede beliebige Google-Schriftart in Ihrem Design, ohne die Privatsphäre der Besucher zu gefährden.

# plugins.generic.googleFonts.fonts
source: Fonts
de_de: Schriftarten

# plugins.generic.googleFonts.selectFont
source: Select a Font
de_de: Schriftart auswählen

# plugins.generic.googleFonts.addFont
source: Add Font
de_de: Schriftart hinzufügen

# plugins.generic.googleFonts.addFont.description
source: Select any one of the <a href="{$url}" target="_blank">Google Fonts</a> and add it to your site.
de_de: Wählen Sie eine der <a href="{$url}" target="_blank">Google-Schriftarten</a> aus und fügen Sie sie Ihrer Website hinzu.

# plugins.generic.googleFonts.noFontsEnabled
source: You have not added any fonts to your site.
de_de: Sie haben Ihrer Website noch keine Schriftarten hinzugefügt.

# plugins.generic.googleFonts.howToUse
source: Not seeing the fonts on your site? Learn how to <a href="{$url}" target="_blank">use a custom font</a> in your theme.
de_de: Die Schriftarten werden auf Ihrer Website nicht angezeigt? Erfahren Sie, wie Sie eine <a href="{$url}" target="_blank">benutzerdefinierte Schriftart</a> in Ihrem Theme verwenden können.

# plugins.generic.googleFonts.fontCountWarning
source: You shouldn't use more than one or two fonts on your site. <a href="{$url}" target="_blank">Learn more</a>
de_de: Sie sollten nicht mehr als ein oder zwei Schriftarten auf Ihrer Website verwenden. <a href="{$url}" target="_blank">Erfahren Sie mehr</a>

# plugins.generic.googleFonts.technicalError
source: An unexpected error occurred. Please contact your system administrator. The following error was encountered: {$error}
de_de: Es ist ein unerwarteter Fehler aufgetreten. Bitte wenden Sie sich an Ihren Systemadministrator. Folgender Fehler wurde festgestellt: {$error}

# plugins.generic.googleFonts.help.title
source: Google Fonts Plugin: Common Questions and Answers
de_de: Google Fonts Plugin: Häufige Fragen und Antworten

# plugins.generic.googleFonts.help.about
source: The Google Fonts plugin for OJS, OMP and OPS helps you use any <a href="{$googleFontsUrl}" target="_blank">Google Font</a> in your theme without compromising visitor privacy. It downloads, stores and serves the custom font files to your visitors from your own server, so that they aren't tracked by Google.
de_de: Das Google Fonts Plugin für OJS, OMP und OPS ermöglicht es Ihnen, jede beliebige <a href="{$googleFontsUrl}" target="_blank">Google-Schriftart</a> in Ihrem Design zu verwenden, ohne die Privatsphäre der Besucher zu gefährden. Es lädt, speichert und stellt die benutzerdefinierten Schriftartdateien direkt von Ihrem Server bereit, sodass die Besucher nicht von Google getrackt werden.

# plugins.generic.googleFonts.help.fontsNotShown
source: I added fonts but they aren't showing up on my site
de_de: Ich habe Schriftarten hinzugefügt, aber sie werden nicht auf meiner Website angezeigt

# plugins.generic.googleFonts.help.fontsNotShown.answer
source: The plugin loads the font files onto your site, but they will not change how your site appears until they are assigned to the text elements on your site. If your theme doesn't do this for you automatically, you will need to add custom CSS code to your site. You can add custom CSS to your site by uploading a <code>.css</code> file to <strong>Settings > Appearance > Advanced > Style sheet</strong>.
de_de: Das Plugin lädt die Schriftartdateien auf Ihre Website, aber sie ändern nicht automatisch das Erscheinungsbild Ihrer Website. Wenn Ihr Design dies nicht automatisch für Sie erledigt, müssen Sie benutzerdefinierten CSS-Code zu Ihrer Website hinzufügen. Sie können benutzerdefiniertes CSS hinzufügen, indem Sie eine <code>.css</code>-Datei unter <strong>Einstellungen > Aussehen > Fortgeschritten > Style sheet der Zeitschrift</strong> hochladen.

# plugins.generic.googleFonts.help.fontsNotShown.example
source: The following is an example of CSS code that will apply the <strong>Urbanist</strong> font to some of the text on your site.
de_de: Das folgende Beispiel zeigt CSS-Code, der die Schriftart <strong>Urbanist</strong> auf einigen Texten Ihrer Website anwendet.

# plugins.generic.googleFonts.help.fontsNotShown.contactAdmin
source: If you're not sure how to use this, you may need to contact technical support for your journal, press or preprint server.
de_de: Wenn Sie nicht wissen, wie Sie dies verwenden können, müssen Sie möglicherweise den technischen Support für Ihr Journal, Ihren Verlag oder Ihren Preprint-Server kontaktieren.

# plugins.generic.googleFonts.help.tooManyFonts
source: How many fonts should be used?
de_de: Wie viele Schriftarten sollten verwendet werden?

# plugins.generic.googleFonts.help.tooManyFonts.answer
source: You should almost never use more than one or two fonts on your site. Professional designers pair their type faces carefully and only rarely use more than two for a single website. If you don't have a professional designer involved in the choices you make, you should choose one font for your site and stick to that.
de_de: Sie sollten fast nie mehr als ein oder zwei Schriftarten auf Ihrer Website verwenden. Professionelle Designer wählen ihre Schriftarten sorgfältig aus und verwenden nur selten mehr als zwei für eine einzige Website. Wenn kein professioneller Designer an den Entscheidungen beteiligt ist, sollten Sie eine Schriftart für Ihre Website auswählen und bei dieser bleiben.

# plugins.generic.googleFonts.help.gdpr
source: How does this plugin help protect my visitors' privacy?
de_de: Wie hilft dieses Plugin dabei, die Privatsphäre meiner Besucher zu schützen?

# plugins.generic.googleFonts.help.gdpr.answer
source: When you add a font with this plugin, your server downloads and stores the font files from Google. When someone visits your website, they are sent the font file from your server instead of Google's server.
de_de: Wenn Sie mit diesem Plugin eine Schriftart hinzufügen, lädt Ihr Server die Schriftartdateien von Google herunter und speichert sie. Wenn jemand Ihre Website besucht, wird die Schriftartdatei von Ihrem Server und nicht von Googles Server bereitgestellt.

# plugins.generic.googleFonts.help.gdpr.compliance
source: This helps comply with some privacy regulation, such as Europe's <a href="{$gdprUrl}" target="_blank">GDPR</a>, without requiring you to add legal language to your site's privacy notice or making your users click a consent popup.
de_de: Dies hilft, bestimmte Datenschutzbestimmungen, wie die europäische <a href="{$gdprUrl}" target="_blank">DSGVO</a>, einzuhalten, ohne dass Sie rechtliche Hinweise in die Datenschutzrichtlinie Ihrer Website aufnehmen oder Ihre Benutzer zu einer Zustimmung auffordern müssen.

# plugins.generic.googleFonts.help.license
source: What license do these fonts use?
de_de: Welche Lizenz haben diese Schriftarten?

# plugins.generic.googleFonts.help.license.answer
source: All of the Google Fonts are under a permissive license which allows you to use them free of charge. Most fonts use the <a href="{$silUrl}" target="_blank">SIL Open Font License</a>, but each font may be different. Click the link beside each font you have added to learn more about the license on the Google Fonts website.
de_de: Alle Google-Schriftarten stehen unter einer permissiven Lizenz, die ihre kostenlose Nutzung erlaubt. Die meisten Schriftarten verwenden die <a href="{$silUrl}" target="_blank">SIL Open Font License</a>, aber jede Schriftart kann unterschiedlich sein. Klicken Sie auf den Link neben jeder hinzugefügten Schriftart, um mehr über die Lizenz auf der Google Fonts-Website zu erfahren.
